#### import

In [25]:
import numpy as np
import pandas as pd

#### data1

In [26]:
ps = pd.Series(np.array([10,20,30,40,50,60,70,80,90,100]))
ps

0     10
1     20
2     30
3     40
4     50
5     60
6     70
7     80
8     90
9    100
dtype: int32

In [27]:
ps[:]

0     10
1     20
2     30
3     40
4     50
5     60
6     70
7     80
8     90
9    100
dtype: int32

In [28]:
ps[1:]

1     20
2     30
3     40
4     50
5     60
6     70
7     80
8     90
9    100
dtype: int32

In [29]:
ps[3:9]

3    40
4    50
5    60
6    70
7    80
8    90
dtype: int32

#### data2

In [37]:
df = pd.DataFrame(
    np.array(
        [
            ["M.S.Dhoni", 36, 75, 5428000],
            ["A.B.D Villers", 38, 74, 3428000],
            ["V.Kohli", 31, 70, 8428000],
            ["S.Smith", 34, 80, 4428000],
            ["C.Gayle", 40, 100, 4528000],
            ["J.Root", 33, 72, 7028000],
            ["K.Peterson", 42, 85, 2528000],
        ]
    ),columns=['Name','Age','Weight','Salary']
)
df.to_csv("player_list.csv")
df

            Name Age Weight   Salary
0      M.S.Dhoni  36     75  5428000
1  A.B.D Villers  38     74  3428000
2        V.Kohli  31     70  8428000
3        S.Smith  34     80  4428000
4        C.Gayle  40    100  4528000
5         J.Root  33     72  7028000
6     K.Peterson  42     85  2528000

In [31]:
df1 = df.iloc[0:4]
df1

            Name Age Weight   Salary
0      M.S.Dhoni  36     75  5428000
1  A.B.D Villers  38     74  3428000
2        V.Kohli  31     70  8428000
3        S.Smith  34     80  4428000

In [32]:
df1 = df.iloc[:,0:2]
df1

            Name Age
0      M.S.Dhoni  36
1  A.B.D Villers  38
2        V.Kohli  31
3        S.Smith  34
4        C.Gayle  40
5         J.Root  33
6     K.Peterson  42

#### selecting a specific cell in df

In [34]:
specific_cell_value = df.iloc[2, 3]  # Row 2, Column 3 (Salary)
print("Specific Cell Value:", specific_cell_value)

Specific Cell Value: 8428000

#### Using Boolean Conditions  in Dataframe

In [46]:
df['Age'] = pd.to_numeric(df['Age'])

In [50]:
filtered_data = df[df['Age'] > 35].iloc[:,:]
filtered_data

            Name  Age Weight   Salary
0      M.S.Dhoni   36     75  5428000
1  A.B.D Villers   38     74  3428000
4        C.Gayle   40    100  4528000
6     K.Peterson   42     85  2528000

In [51]:
df_custom = df.set_index('Name')
df_custom

               Age Weight   Salary
Name
M.S.Dhoni       36     75  5428000
A.B.D Villers   38     74  3428000
V.Kohli         31     70  8428000
S.Smith         34     80  4428000
C.Gayle         40    100  4528000
J.Root          33     72  7028000
K.Peterson      42     85  2528000

In [57]:
sliced_rows_custom = df_custom.loc['A.B.D Villers':'S.Smith']
sliced_rows_custom

               Age Weight   Salary
Name
A.B.D Villers   38     74  3428000
V.Kohli         31     70  8428000
S.Smith         34     80  4428000